Creating a VPC connection type:
```
jkalanda@Josephs-MacBook-Pro transitgateway % terraform plan 
data.ibm_tg_gateway.existing_tg_gw: Reading...
data.ibm_tg_gateway.existing_tg_gw: Read complete after 4s [id=b9507191-b6f5-4476-b820-16eddc34638d]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_tg_connection.test_ibm_tg_connection will be created
  + resource "ibm_tg_connection" "test_ibm_tg_connection" {
      + base_connection_id    = (known after apply)
      + base_network_type     = (known after apply)
      + connection_id         = (known after apply)
      + created_at            = (known after apply)
      + default_prefix_filter = (known after apply)
      + gateway               = "b9507191-b6f5-4476-b820-16eddc34638d"
      + id                    = (known after apply)
      + local_gateway_ip      = "192.193.200.1"
      + local_tunnel_ip       = "192.193.239.2"
      + name                  = "vpc-terraform-jk"
      + network_account_id    = (known after apply)
      + network_id            = "crn:v1:staging:public:is:us-south:a/3aa0a4551a1a46258064d84f7f447920::vpc:r134-0b74cf24-b26e-499d-8440-473f9978f407"
      + network_type          = "vpc"
      + related_crn           = (known after apply)
      + remote_gateway_ip     = "10.144.104.123"
      + remote_tunnel_ip      = "192.193.239.1"
      + request_status        = (known after apply)
      + status                = (known after apply)
      + updated_at            = (known after apply)
      + zone                  = "us-south-1"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
jkalanda@Josephs-MacBook-Pro transitgateway % terraform apply
data.ibm_tg_gateway.existing_tg_gw: Reading...
data.ibm_tg_gateway.existing_tg_gw: Read complete after 3s [id=b9507191-b6f5-4476-b820-16eddc34638d]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_tg_connection.test_ibm_tg_connection will be created
  + resource "ibm_tg_connection" "test_ibm_tg_connection" {
      + base_connection_id    = (known after apply)
      + base_network_type     = (known after apply)
      + connection_id         = (known after apply)
      + created_at            = (known after apply)
      + default_prefix_filter = (known after apply)
      + gateway               = "b9507191-b6f5-4476-b820-16eddc34638d"
      + id                    = (known after apply)
      + local_gateway_ip      = "192.193.200.1"
      + local_tunnel_ip       = "192.193.239.2"
      + name                  = "vpc-terraform-jk"
      + network_account_id    = (known after apply)
      + network_id            = "crn:v1:staging:public:is:us-south:a/3aa0a4551a1a46258064d84f7f447920::vpc:r134-0b74cf24-b26e-499d-8440-473f9978f407"
      + network_type          = "vpc"
      + related_crn           = (known after apply)
      + remote_gateway_ip     = "10.144.104.123"
      + remote_tunnel_ip      = "192.193.239.1"
      + request_status        = (known after apply)
      + status                = (known after apply)
      + updated_at            = (known after apply)
      + zone                  = "us-south-1"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_tg_connection.test_ibm_tg_connection: Creating...
ibm_tg_connection.test_ibm_tg_connection: Still creating... [10s elapsed]
ibm_tg_connection.test_ibm_tg_connection: Still creating... [20s elapsed]
ibm_tg_connection.test_ibm_tg_connection: Still creating... [30s elapsed]
ibm_tg_connection.test_ibm_tg_connection: Creation complete after 39s [id=b9507191-b6f5-4476-b820-16eddc34638d/c357c239-98f8-44f9-80c0-0c0f78a9fb19]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
jkalanda@Josephs-MacBook-Pro transitgateway % terraform plan 
data.ibm_tg_gateway.existing_tg_gw: Reading...
data.ibm_tg_gateway.existing_tg_gw: Read complete after 6s [id=b9507191-b6f5-4476-b820-16eddc34638d]
ibm_tg_connection.test_ibm_tg_connection: Refreshing state... [id=b9507191-b6f5-4476-b820-16eddc34638d/c357c239-98f8-44f9-80c0-0c0f78a9fb19]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

```